app/views/exhibitions/show.html.erb

								<% if user_signed_in? %>
									<% if @visits.where(:user_id => current_user.id).any? || (@exhibition.place.user_id == current_user.id) %>
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]