app/controllers/exhibitions_controller.rb

  def index
    @exhibitions = Exhibition.all
---
SELECT "exhibitions".* FROM "exhibitions"

  def new
    @place = Place.find params[:place_id] if params[:place_id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @exhibition = Exhibition.new(exhibition_params)

    # debugger

    respond_to do |format|
      if @exhibition.save
---
INSERT INTO "exhibitions" ("name", "description", "capacity", "artist_id", "status", "place_id", "opening_at", "closing_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_exhibition
      @exhibition = Exhibition.find(params[:id])
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]