app/controllers/expos_controller.rb

SELECT "expos".* FROM "expos"  ORDER BY created_at DESC
---
  def index
    @expos = Expo.all.order('created_at DESC')

INSERT INTO "expos" ("name", "content", "capacity", "is_handi", "surface", "address_city", "address_street", "address_cp", "address_infos", "opening_date", "closing_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @expo = Expo.new(expo_params)
    @expo.user = current_user

    respond_to do |format|
      if @expo.save

UPDATE "expos" SET "content" = $1, "updated_at" = $2 WHERE "expos"."id" = $3  [["content", "Wow, c'est ouf quand même ! Tant d'art ça me fait beaucoup d'effet ! :o"], ["updated_at", "2016-03-16 03:13:50.782116"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @expo.update(expo_params)

DELETE FROM "expos" WHERE "expos"."id" = $1  [["id", 1]]
---
  def destroy
    @expo.destroy

SELECT  "expos".* FROM "expos" WHERE "expos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_expo
      @expo = Expo.find(params[:id])