app/controllers/pages_controller.rb

  def index
    @places = Place.all.order('created_at DESC')
    @exhibitions = Exhibition.all.order('created_at DESC')
---
SELECT "places".* FROM "places"  ORDER BY created_at DESC
SELECT "exhibitions".* FROM "exhibitions"  ORDER BY created_at DESC