app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT "places".* FROM "places"  ORDER BY created_at DESC

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("name", "description", "address", "zipcode", "city", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", ""], ["description", ""], ["address", ""], ["zipcode", ""], ["city", ""], ["user_id", 2], ["created_at", "2016-03-16 10:42:36.470182"], ["updated_at", "2016-03-16 10:42:36.470182"]]

  def update
    respond_to do |format|
      if @place.update(place_params)
---
UPDATE "places" SET "user_id" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["user_id", 3], ["updated_at", "2016-03-16 08:59:04.973403"], ["id", 1]]