app/controllers/users_controller.rb

  def demands
    @places = Place.all.where("user_id = :user_id AND status = :status", {user_id: current_user, status: "pending"})
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 2]]