app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @places = Place.where(user_id: @user.id)
    @exhibitions = Exhibition.where(artist_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "places".* FROM "places" WHERE "places"."user_id" = ?  [["user_id", 1]]
SELECT "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."artist_id" = ?  [["artist_id", 1]]